## csp_violation_report_service
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                            NAME                                             |
|--------|---------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.csp_reports`                                                           |
|        | `aws_acm_certificate_validation.csp_reports`                                                |
|        | `aws_cloudfront_distribution.csp_reports`                                                   |
|        | `aws_route53_record.csp_reports_A`                                                          |
|        | `aws_route53_record.csp_reports_cert_validation[&quot;*.csp-report-to.security.cdssandbox.xyz&quot;]` |
|        | `aws_route53_record.csp_reports_cert_validation[&quot;csp-report-to.security.cdssandbox.xyz&quot;]`   |
| update | `module.csp_reports.aws_lambda_function.this`                                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_acm_certificate.csp_reports will be created
  + resource "aws_acm_certificate" "csp_reports" {
      + arn                       = (known after apply)
      + domain_name               = "csp-report-to.security.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.csp-report-to.security.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "csp-report-to.security.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.csp-report-to.security.cdssandbox.xyz",
          + "csp-report-to.security.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "csp_violation_report_service"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "csp_violation_report_service"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = (known after apply)
        }
    }

  # aws_acm_certificate_validation.csp_reports will be created
  + resource "aws_acm_certificate_validation" "csp_reports" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.csp_reports will be created
  + resource "aws_cloudfront_distribution" "csp_reports" {
      + aliases                        = [
          + "csp-report-to.security.cdssandbox.xyz",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "CostCentre" = "csp_violation_report_service"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "csp_violation_report_service"
          + "Terraform"  = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id            = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = "b689b0a8-53d0-40ab-baf2-68738e2966ac"
          + response_headers_policy_id = "67f7725c-6f97-4210-82d7-5512b31e9d03"
          + target_origin_id           = "csp_violation_report_service"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "kwy7wd4whpfrl6uplrm35rjgzm0qqupq.lambda-url.ca-central-1.on.aws"
          + origin_id           = "csp_violation_report_service"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 60
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.csp_reports_A will be created
  + resource "aws_route53_record" "csp_reports_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "csp-report-to.security.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z03975181DBV17ZUG3VG6"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.csp_reports_cert_validation["*.csp-report-to.security.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "csp_reports_cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z03975181DBV17ZUG3VG6"
    }

  # aws_route53_record.csp_reports_cert_validation["csp-report-to.security.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "csp_reports_cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z03975181DBV17ZUG3VG6"
    }

  # module.csp_reports.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "csp_violation_report_service"
      ~ memory_size                    = 1024 -> 256
      ~ reserved_concurrent_executions = -1 -> 10
        tags                           = {
            "CostCentre" = "csp_violation_report_service"
            "Terraform"  = "true"
        }
      ~ timeout                        = 120 -> 15
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
